tap "dart-lang/dart"
tap "getsentry/tools"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jetbrains/utils"
tap "mono0926/license-plist"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "sass/sass"
tap "symfony-cli/tap"
# Simple, modern, secure file encryption
brew "age"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline", link: true
# Command-line interface for SQLite
brew "sqlite"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Incrementally update/translate your Strings files
brew "bartycrouch"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Manage compile and link flags for libraries
brew "pkg-config"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# Unit testing framework for C
brew "cmocka"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Generic library support script
brew "libtool"
# Network authentication protocol
brew "krb5"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Pack, ship and run any application as a lightweight container
brew "docker"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Version Control Visualization Tool
brew "gource"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Portable abstraction of the hierarchical topology of modern architectures
brew "hwloc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable low-level networking library
brew "libdnet"
# Portable Foreign Function Interface library
brew "libffi"
# Portable library for network traffic capture
brew "libpcap"
# Swiss Army Knife for macOS
brew "m-cli"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Perl compatible regular expressions library
brew "pcre"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# Command-line client for OpenStack
brew "openstackclient"
# Small collection of programs that operate on patch files
brew "patchutils"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Password generator
brew "pwgen"
# Utility that provides fast incremental file transfer
brew "rsync"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Database of common MIME types
brew "shared-mime-info"
# GNU's portable shell tool
brew "shtool"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Swift code generator for assets, storyboards, Localizable.strings, etc.
brew "swiftgen"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Modular BSD reimplementation of NASM
brew "yasm"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Symfony CLI helps Symfony developers manage projects, from local code to remote infrastructure
brew "symfony-cli/tap/symfony-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Apple TV Aerial screensaver
cask "aerial"
# App to build and share containerized applications and microservices
cask "docker"
# Typeface made for developers
cask "font-jetbrains-mono"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# MySQL/MariaDB database management
cask "sequel-ace"
# Install and switch between multiple versions of Xcode
cask "xcodes"
